swiecakm/time-radar/Src/stm32f0xx_hd44780.c
#include "stm32f0xx_hd44780.h"
#include "main.h"

//Initial commands
#define HD44780_COMMAND_CLEAR 1
#define HD44780_COMMAND_RETURN_HOME 2
#define HD44780_COMMAND_INCR_DDRAM_AND_NO_SHIFT 6
#define HD44780_COMMAND_DISPLAY_ON_CURSOR_OFF_BLINK_OFF 12
#define HD44780_COMMAND_DISPLAY_MOVE_DISPLAY 16
#define HD44780_COMMAND_8BIT_TWO_LINES_5x8 56

uint16_t HD44780_OUTPINS[8] = {
	HD44780_D0_Pin,
	HD44780_D1_Pin,
	HD44780_D2_Pin,
	HD44780_D3_Pin,
	HD44780_D4_Pin,
	HD44780_D5_Pin,
	HD44780_D6_Pin,
	HD44780_D7_Pin
};

const int HD44780_COMMAND_DELAY = 1;

void HD44780_Initialize(void)
{
	HAL_GPIO_WritePin(GPIOC, HD44780_RS_Pin, GPIO_PIN_RESET);
	
	HD44780_SendCommand(HD44780_COMMAND_CLEAR);
	HAL_Delay(HD44780_COMMAND_DELAY);

	HD44780_SendCommand(HD44780_COMMAND_RETURN_HOME);
	HAL_Delay(HD44780_COMMAND_DELAY);
	
	HD44780_SendCommand(HD44780_COMMAND_INCR_DDRAM_AND_NO_SHIFT);
	HAL_Delay(HD44780_COMMAND_DELAY);
	
	HD44780_SendCommand(HD44780_COMMAND_DISPLAY_ON_CURSOR_OFF_BLINK_OFF);
	HAL_Delay(HD44780_COMMAND_DELAY);
	
	HD44780_SendCommand(HD44780_COMMAND_8BIT_TWO_LINES_5x8);
	HAL_Delay(HD44780_COMMAND_DELAY);
	
	HAL_GPIO_WritePin(GPIOC, HD44780_RS_Pin, GPIO_PIN_SET);
	HAL_Delay(HD44780_COMMAND_DELAY);
}

void HD44780_SendCommand(int data)
{
	HAL_GPIO_WritePin(GPIOC, HD44780_E_Pin, GPIO_PIN_SET);
	HAL_Delay(HD44780_COMMAND_DELAY);
	for (int i=0; i<8; i++) 
	{
		int value = (1 & (data >> i));
		HAL_GPIO_WritePin(GPIOC, HD44780_OUTPINS[i], value);
	}
	HAL_Delay(HD44780_COMMAND_DELAY);
	HAL_GPIO_WritePin(GPIOC, HD44780_E_Pin, GPIO_PIN_RESET);
	HAL_Delay(HD44780_COMMAND_DELAY);
}
